app/controllers/leads_controller.rb

SELECT "leads".* FROM "leads"
---
  def index
    @leads = Lead.all

INSERT INTO "leads" ("name", "last_name", "email", "company", "job_title", "phone", "website", "salesforce_id", "salesforce_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @lead = Lead.new(lead_params)

    respond_to do |format|
      if @lead.save

DELETE FROM "leads" WHERE "leads"."id" = $1  [["id", 1]]
---
  def destroy
    @lead.destroy

SELECT  "leads".* FROM "leads" WHERE "leads"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_lead
    @lead = Lead.find(params[:id])